from flask import Flask, render_template, request, jsonify

app = Flask(__name__)

# ---------------------------------------------------------------------------------
# hello world
#  ---------------------------------------------------------------------------------


@app.route("/")
def index():
    return "やあ世界"


# ---------------------------------------------------------------------------------
# テンプレートを使う
# ---------------------------------------------------------------------------------


@app.route("/temp")
def temp():
    return render_template("mytemplate.html", title="flask test", name="yama")

# ---------------------------------------------------------------------------------
# URLパラメータを使う
# ---------------------------------------------------------------------------------
# /hoge/hogeval


@app.route("/hoge/<name>")  # <name> がそのままパラメータになる
def hoge(name=None):
    return name

# ---------------------------------------------------------------------------------
# GETパラメータを使う
# ---------------------------------------------------------------------------------
# /fuga?name=fugaval


@app.route("/fuga")
def fuga():
    return f"GETの name パラメータ値は「{request.args.get('name')}」"


# ---------------------------------------------------------------------------------
# POST メソッドを使う
# ---------------------------------------------------------------------------------
# /post

@app.route("/postinput")
def postinput():
    return render_template("input.html", title="post test")


@app.route("/post", methods=["POST"])
def post():
    if request.method == "POST":
        name = request.form["name"]
    else:
        name = "no param"

    return f"入力したのは「{name}」"

# ---------------------------------------------------------------------------------
# JSON レスポンスを返却
# ---------------------------------------------------------------------------------


@app.route("/json")
def json_res():
    data = [
        {"name": "yama", "age": 53, "hobby": "bike"},
        {"name": "kari", "age": 21, "hobby": "singing"},
    ]
    return jsonify(data)


# １件しかないとき、下記でも同じ
@app.route("/json2")
def json_res2():
    return jsonify(
        name="yama",
        age=53,
        hobby="bike"
    )


# ---------------------------------------------------------------------------------
# main
# ---------------------------------------------------------------------------------
if __name__ == "__main__":
    app.run()
